<a href="https://colab.research.google.com/github/linhn0617/prctice/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
import pandas as pd

In [18]:
import numpy as np

In [19]:
classes = ['1A', '1A', '1A', '1B', '1B', '1C', '1C', '1C']
name = ['Peter', 'John', 'Keven', 'JoJo', 'Mary', 'Eva', 'Tom', 'Simon']
math = [95, 95, 76, 90, 96, 84, 84, 98]
english = [64,88,85,88,78,60,63, 84]

In [20]:
topic = {'class':classes, 'name':name, 'math':math, 'english':english}

In [21]:
students = pd.DataFrame(topic)
students

  class   name  math  english
0    1A  Peter    95       64
1    1A   John    95       88
2    1A  Keven    76       85
3    1B   JoJo    90       88
4    1B   Mary    96       78
5    1C    Eva    84       60
6    1C    Tom    84       63
7    1C  Simon    98       84

In [22]:
grouped = students.groupby('class')
grouped

In [23]:
grouped2 = students.groupby(['class','math'])
grouped2

In [24]:
students.groupby('class').mean()

            math  english
class
1A     88.666667     79.0
1B     93.000000     83.0
1C     88.666667     69.0

In [25]:
g1a = grouped.get_group('1A')
g1a

  class   name  math  english
0    1A  Peter    95       64
1    1A   John    95       88
2    1A  Keven    76       85

In [26]:
g1a.loc[1]

class        1A
name       John
math         95
english      88
Name: 1, dtype: object

In [27]:
g1a.loc[g1a.name == 'Peter']

  class   name  math  english
0    1A  Peter    95       64

In [28]:
grouped2.get_group(('1A', 95))
# 因為它是用兩個欄位來分組(class及math)，所以要存取某個group時，要用tuple來指定要存取的組別。

  class   name  math  english
0    1A  Peter    95       64
1    1A   John    95       88

In [29]:
grouped.first()

        name  math  english
class
1A     Peter    95       64
1B      JoJo    90       88
1C       Eva    84       60

In [30]:
super = grouped.english.idxmax()
super

class
1A    1
1B    3
1C    7
Name: english, dtype: int64

In [31]:
students.loc[super]

  class   name  math  english
1    1A   John    95       88
3    1B   JoJo    90       88
7    1C  Simon    98       84

In [32]:
grouped.english.agg(['max','mean'])

       max  mean
class
1A      88    79
1B      88    83
1C      84    69